function p = twomodegauss(m1, sig1, m2, sig2, A1, A2, k)
% 生成一个双峰值的高斯函数
% p是一个256个元素组成的归一化向量，两个模型的平均值和标准差分别是（m1, sig1),(m2, sig2)，m1和m2
% 的范围为[0,1], 幅度分别是A1 和 A2
% K是偏置量
c1 = A1 * (1 / ((2 * pi) ^ 0.5 * sig1));
% 课本：c1 = A1 * (1 / ((2 * pi) ^ 0.5) * sig1); % c1 c2都是
% c1 = A1 * (1 / ((2 * pi) ^ 0.5 * sig1)); 极度觉得是这个表达式
k1 = 2 * (sig1 ^ 2);
c2 = A2 * (1 / ((2 * pi) ^ 0.5 * sig2));
k2 = 2 * (sig2 ^ 2);
z = linspace(0, 1, 256);
p = k + c1 * exp(-((z - m1) .^ 2) ./ k1) + c2 * exp(-((z - m2) .^ 2) ./ k2);
p = p ./ sum(p(:));
